// Задача 2 Дана json строка (сохранить в файл и читать из файла) 
//     [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},
//             {"фамилия":"Петрова", "оценка":"4","предмет":"Информатика"},
//                     {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
//     Написать метод(ы), который распарсит json и, используя StringBuilder, 
//     создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет].
//     Пример вывода:
//     Студент Иванов получил 5 по предмету Математика.
//     Студент Петрова получил 4 по предмету Информатика.
//     Студент Краснов получил 5 по предмету Физика.

import java.io.File;
import java.io.IOException;
import java.io.PrintWriter;

public class HomeWork_2 {

    private static final String JSON = 
        "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\", \"предмет\":\"Математика\"},"+
        "{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"},"+
        "{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";

    public static void main(String[] args) {
        try {
            File file = new File("J_S2_HW2.json");

            if (file.exists())  // если файл не существует
                file.createNewFile();  // создание файла

            PrintWriter pw = new PrintWriter(file);
            pw.println(JSON);
            pw.close();

        } catch (IOException e) {
            System.out.print("error: " + e);
        }
    }    
}